{
  "\t": 117,
  "\n": 24,
  " ": 0,
  "!": 53,
  "\"": 31,
  "#": 173,
  "$": 167,
  "%": 127,
  "&": 71,
  "'": 27,
  "(": 63,
  ")": 62,
  "*": 94,
  ",": 23,
  "-": 34,
  ".": 19,
  "/": 58,
  "0": 69,
  "1": 68,
  "2": 73,
  "3": 76,
  "4": 87,
  "5": 89,
  "6": 81,
  "7": 98,
  "8": 102,
  "9": 84,
  ":": 51,
  ";": 44,
  "<": 29,
  "=": 79,
  ">": 30,
  "?": 36,
  "A": 32,
  "B": 42,
  "C": 55,
  "D": 43,
  "E": 47,
  "F": 56,
  "G": 49,
  "H": 41,
  "I": 26,
  "J": 59,
  "K": 60,
  "L": 40,
  "M": 45,
  "N": 46,
  "O": 48,
  "P": 50,
  "Q": 75,
  "R": 57,
  "S": 35,
  "T": 28,
  "U": 61,
  "V": 64,
  "W": 33,
  "X": 109,
  "Y": 37,
  "Z": 82,
  "[": 66,
  "]": 67,
  "_": 153,
  "`": 120,
  "a": 4,
  "b": 20,
  "c": 17,
  "d": 11,
  "e": 1,
  "f": 16,
  "g": 18,
  "h": 9,
  "i": 6,
  "j": 39,
  "k": 25,
  "l": 10,
  "m": 14,
  "n": 5,
  "o": 3,
  "p": 21,
  "q": 54,
  "r": 8,
  "s": 7,
  "t": 2,
  "u": 12,
  "v": 22,
  "w": 15,
  "x": 38,
  "y": 13,
  "z": 52,
  "{": 161,
  "}": 162,
  "~": 116,
  "\u00ab": 186,
  "\u00bb": 187,
  "\u00ce": 170,
  "\u00e0": 160,
  "\u00e1": 155,
  "\u00e2": 141,
  "\u00e3": 183,
  "\u00e7": 144,
  "\u00e8": 188,
  "\u00e9": 122,
  "\u00ea": 185,
  "\u00f3": 182,
  "\u00f6": 154,
  "\u00f9": 184,
  "\u00fc": 128,
  "\u0103": 171,
  "\u011f": 143,
  "\u0131": 93,
  "\u015f": 145,
  "\u0219": 172,
  "\u021b": 142,
  "\u0418": 136,
  "\u041b": 177,
  "\u041d": 178,
  "\u0421": 176,
  "\u0422": 174,
  "\u0430": 96,
  "\u0431": 175,
  "\u0432": 101,
  "\u0433": 133,
  "\u0434": 132,
  "\u0435": 91,
  "\u0437": 134,
  "\u0438": 88,
  "\u0439": 158,
  "\u043a": 131,
  "\u043b": 130,
  "\u043c": 135,
  "\u043d": 97,
  "\u043e": 90,
  "\u043f": 156,
  "\u0440": 118,
  "\u0441": 99,
  "\u0442": 108,
  "\u0443": 179,
  "\u0445": 159,
  "\u0446": 180,
  "\u0447": 129,
  "\u0448": 123,
  "\u0449": 157,
  "\u044a": 119,
  "\u044f": 181,
  "\u060c": 139,
  "\u0623": 110,
  "\u0624": 165,
  "\u0625": 138,
  "\u0626": 147,
  "\u0627": 72,
  "\u0628": 111,
  "\u0629": 121,
  "\u062a": 104,
  "\u062b": 168,
  "\u062c": 115,
  "\u062d": 105,
  "\u062e": 169,
  "\u062f": 103,
  "\u0630": 125,
  "\u0631": 83,
  "\u0632": 126,
  "\u0633": 114,
  "\u0634": 112,
  "\u0635": 149,
  "\u0636": 150,
  "\u0637": 152,
  "\u0639": 107,
  "\u063a": 151,
  "\u0641": 95,
  "\u0642": 100,
  "\u0643": 86,
  "\u0644": 70,
  "\u0645": 77,
  "\u0646": 74,
  "\u0647": 85,
  "\u0648": 92,
  "\u0649": 113,
  "\u064a": 80,
  "\u064b": 148,
  "\u0650": 166,
  "\u0651": 137,
  "\u200e": 163,
  "\u2013": 164,
  "\u2014": 78,
  "\u2015": 140,
  "\u2018": 124,
  "\u2019": 65,
  "\u201c": 146,
  "\u2026": 106
}